// components/CookiesPage.js

import React from "react";

const CookiesPage = () => {
  return (
    <div className="container mx-auto py-8 mt-24">
      <div className="max-w-7xl mx-auto  shadow-md p-8 rounded">
        <h1 className="text-3xl font-bold mb-4">Политика за бисквитки</h1>
        <p className="text-lg text-gray-700 mb-4">
          Вашата поверителност е важна за нас. Тази политика за бисквитки
          обяснява как и защо използваме бисквитки на нашия уебсайт.
        </p>
        <h2 className="text-2xl font-bold mt-6 mb-2">Какво са бисквитките?</h2>
        <p className="text-lg text-gray-700 mb-4">
          Бисквитките са малки текстови файлове, които се съхраняват на вашето
          устройство, когато посещавате уебсайт. Те позволяват на уебсайта да
          запомни вашите действия и предпочитания (като например входните данни,
          езика, размера на шрифта и други предпочитания на отображение) за
          определен период от време, така че вие не трябва да ги въвеждате
          отново, когато се връщате на сайта или превключвате от една страница
          на друга.
        </p>
        <h2 className="text-2xl font-bold mt-6 mb-2">
          Как използваме бисквитките?
        </h2>
        <p className="text-lg text-gray-700 mb-4">
          Нашият уебсайт използва бисквитки за различни цели, включително за
          подобряване на вашето преживяване на потребителите, анализиране на
          трафика и персонализиране на съдържанието. Също така използваме
          бисквитки, които са необходими за основните функции на сайта, като
          например сесиите на потребителите в чат секцията.
        </p>
        <h2 className="text-2xl font-bold mt-6 mb-2">
          Как да управлявате бисквитките?
        </h2>
        <p className="text-lg text-gray-700 mb-4">
          Можете да контролирате и/или изтривате бисквитки по ваш избор.
          Подробности можете да намерите в раздела за помощ на браузъра си или
          на сайта www.aboutcookies.org, който предоставя информация за
          управлението на бисквитките във всеки от общо използваните браузъри.
        </p>
        <h2 className="text-2xl font-bold mt-6 mb-2">
          Събиране на лични данни, включително IP адреси
        </h2>

        <p className="text-lg text-gray-700 mb-4">
          Събираме лични данни, включително IP адреси, само ако те са
          предоставени от вас, например чрез попълване на контактна форма или
          при анализ на трафика на уебсайта. IP адресите се използват за целите
          на съответните услуги или в съответствие с приложимото
          законодателство.
        </p>
        <h2 className="text-2xl font-bold mt-6 mb-2">
          Как да управлявате бисквитките?
        </h2>
        <p className="text-lg text-gray-700 mb-4">
          Можете да контролирате и/или изтривате бисквитки по ваш избор.
          Подробности можете да намерите в раздела за помощ на браузъра си или
          на сайта www.aboutcookies.org, който предоставя информация за
          управлението на бисквитките във всеки от общо използваните браузъри.
        </p>
      </div>
    </div>
  );
};

export default CookiesPage;
