// components/CookiesPage.js

import React from "react";

const CookiesPage = () => {
  return (
    <div class=" w-full lg:w-10/12 mx-auto p-4 bg-slate-100 p-4 lg:p-24 ">
      <h1 class="text-3xl font-bold mb-4 mt-24 text-center">
        Политика за поверителност
      </h1>
      <p class="text-sm mb-4">Последна актуализация: 23 юли 2024 г.</p>
      <p class="mb-4">
        Тази Политика за поверителност описва нашите политики и процедури за
        събиране, използване и разкриване на вашата информация, когато
        използвате Услугата и ви информира за вашите права за поверителност и
        как законът ви защитава.
      </p>
      <p class="mb-4">
        Ние използваме вашите лични данни, за да предоставяме и подобряваме
        Услугата. Използвайки Услугата, вие се съгласявате с събирането и
        използването на информация в съответствие с тази Политика за
        поверителност. Тази Политика за поверителност е създадена с помощта на{" "}
        <a
          href="https://www.termsfeed.com/privacy-policy-generator/"
          target="_blank"
          class="text-blue-500 underline"
        >
          Генератор на политика за поверителност
        </a>
        .
      </p>

      <h2 class="text-2xl font-bold mb-4">Тълкуване и дефиниции</h2>
      <h3 class="text-xl font-semibold mb-2">Тълкуване</h3>
      <p class="mb-4">
        Думите, чиято начална буква е главна, имат значения, определени при
        следните условия. Следните дефиниции ще имат същото значение независимо
        дали се появяват в единствено или множествено число.
      </p>
      <h3 class="text-xl font-semibold mb-2">Дефиниции</h3>
      <p class="mb-4">За целите на тази Политика за поверителност:</p>
      <ul class="list-disc list-inside mb-4 ">
        <li class="mb-2">
          <strong>Акаунт</strong> означава уникален акаунт, създаден за вас, за
          да получите достъп до нашата Услуга или части от нея.
        </li>
        <li class="mb-2">
          <strong>Афилиейт</strong> означава лице или юридическо лице, което
          контролира, е контролирано или е под общ контрол с дадена страна,
          където „контрол“ означава собственост на 50% или повече от акциите,
          дялове или други ценни книжа, даващи право на глас за избор на
          директори или друг управляващ орган.
        </li>
        <li class="mb-2">
          <strong>Компания</strong> (наричана или „Компанията“, „Ние“, „Нас“ или
          „Нашата“ в това Споразумение) се отнася до Noncreativeblog.
        </li>
        <li class="mb-2">
          <strong>Бисквитки</strong> са малки файлове, които се поставят на
          вашия компютър, мобилно устройство или друго устройство от уебсайт,
          съдържащи подробности за вашата история на сърфиране на този уебсайт
          сред многото му приложения.
        </li>
        <li class="mb-2">
          <strong>Държава</strong> се отнася до: България
        </li>
        <li class="mb-2">
          <strong>Устройство</strong> означава всяко устройство, което може да
          получи достъп до Услугата, като компютър, мобилен телефон или цифров
          таблет.
        </li>
        <li class="mb-2">
          <strong>Лични данни</strong> са всяка информация, която се отнася до
          идентифицирано или подлежащо на идентификация физическо лице.
        </li>
        <li class="mb-2">
          <strong>Услуга</strong> се отнася до Уебсайта.
        </li>
        <li class="mb-2">
          <strong>Доставчик на услуги</strong> означава всяко физическо или
          юридическо лице, което обработва данните от името на Компанията. Това
          се отнася до трети страни, компании или физически лица, наети от
          Компанията за улесняване на Услугата, за предоставяне на Услугата от
          името на Компанията, за извършване на услуги, свързани с Услугата или
          за подпомагане на Компанията в анализа на използването на Услугата.
        </li>
        <li class="mb-2">
          <strong>Данни за употреба</strong> се отнасят до данни, събирани
          автоматично, генерирани от използването на Услугата или от самата
          инфраструктура на Услугата (например продължителността на посещение на
          страница).
        </li>
        <li class="mb-2">
          <strong>Уебсайт</strong> се отнася до Noncreativeblog, достъпен от{" "}
          <a
            href="noncreativeblog.net"
            target="_blank"
            class="text-blue-500 underline"
          >
            noncreativeblog.net
          </a>
        </li>
        <li class="mb-2">
          <strong>Вие</strong> означава лицето, което има достъп или използва
          Услугата, или компанията или друг юридически субект, от името на което
          такова лице има достъп или използва Услугата, според случая.
        </li>
      </ul>

      <h2 class="text-2xl font-bold mb-4 text-center mt-24 mb-16">
        Събиране и използване на вашите лични данни
      </h2>
      <h3 class="text-xl font-semibold mb-2">Видове събирани данни</h3>
      <h4 class="text-lg font-semibold mb-2">Лични данни</h4>
      <p class="mb-4">
        Докато използвате нашата Услуга, можем да ви помолим да ни предоставите
        определена лична информация, която може да се използва за контакт или
        идентифициране на вас. Лично идентифициращата информация може да
        включва, но не се ограничава до:
      </p>
      <ul class="list-disc list-inside mb-4">
        <li class="mb-2">Имейл адрес</li>
        <li class="mb-2">Име и фамилия</li>
        <li class="mb-2">Данни за употреба</li>
      </ul>
      <h4 class="text-lg font-semibold mb-2">Данни за употреба</h4>
      <p class="mb-4">
        Данни за употреба се събират автоматично при използване на Услугата.
      </p>
      <p class="mb-4">
        Данни за употреба могат да включват информация като IP адреса на вашето
        Устройство, тип браузър, версия на браузъра, страниците на нашата
        Услуга, които посещавате, времето и датата на вашето посещение, времето,
        прекарано на тези страници, уникални идентификатори на устройства и
        други диагностични данни.
      </p>
      <p class="mb-4">
        Когато получите достъп до Услугата чрез мобилно устройство, можем да
        събираме определена информация автоматично, включително, но не само,
        типа мобилно устройство, което използвате, уникален идентификатор на
        вашето мобилно устройство, IP адреса на вашето мобилно устройство,
        вашата мобилна операционна система, типа на мобилния интернет браузър,
        който използвате, уникални идентификатори на устройства и други
        диагностични данни.
      </p>
      <p class="mb-4">
        Можем също така да събираме информация, която вашият браузър изпраща,
        когато посещавате нашата Услуга или когато получите достъп до Услугата
        чрез мобилно устройство.
      </p>
      <h4 class="text-lg font-semibold mb-2">
        Технологии за проследяване и бисквитки
      </h4>
      <p class="mb-4">
        Ние използваме бисквитки и подобни технологии за проследяване, за да
        следим активността на нашата Услуга и да съхраняваме определена
        информация. Използваните технологии за проследяване са маяци, тагове и
        скриптове за събиране и проследяване на информация и за подобряване и
        анализ на нашата Услуга.
      </p>
      <p class="mb-4">
        Можете да инструктирате браузъра си да откаже всички бисквитки или да
        посочи кога бисквитка се изпраща. Ако обаче не приемате бисквитки, може
        да не успеете да използвате някои части на нашата Услуга.
      </p>
      <p class="mb-4">
        Бисквитките могат да бъдат „постоянни“ или „сесийни“ бисквитки.
        Постоянните бисквитки остават на вашия персонален компютър или мобилно
        устройство, когато сте офлайн, докато сесийните бисквитки се изтриват
        веднага щом затворите своя уеб браузър.
      </p>
      <p class="mb-4">
        Използваме както сесийни, така и постоянни бисквитки за целите, посочени
        по-долу:
      </p>
      <ul class="list-disc list-inside mb-4">
        <li class="mb-2">
          <strong>Необходими / Съществени бисквитки</strong>
        </li>
        <li class="mb-2">
          <strong>Тип:</strong> Сесийни бисквитки
        </li>
        <li class="mb-2">
          <strong>Управлявани от:</strong> Нас
        </li>
        <li class="mb-2">
          <strong>Цел:</strong> Тези бисквитки са от съществено значение, за да
          ви предоставят услуги, достъпни чрез Уебсайта и да ви позволят да
          използвате някои от неговите функции. Те помагат за удостоверяване на
          потребителите и предотвратяват измамното използване на потребителски
          акаунти. Без тези бисквитки услугите, които сте поискали, не могат да
          бъдат предоставени и ние използваме тези бисквитки само, за да ви
          предоставим тези услуги.
        </li>
        <li class="mb-2">
          <strong>
            Политика за бисквитките / Уведомление за приемане на бисквитки
          </strong>
        </li>
        <li class="mb-2">
          <strong>Тип:</strong> Постоянни бисквитки
        </li>
        <li class="mb-2">
          <strong>Управлявани от:</strong> Нас
        </li>
        <li class="mb-2">
          <strong>Цел:</strong> Тези бисквитки идентифицират дали потребителите
          са приели използването на бисквитки на Уебсайта.
        </li>
        <li class="mb-2">
          <strong>Функционални бисквитки</strong>
        </li>
        <li class="mb-2">
          <strong>Тип:</strong> Постоянни бисквитки
        </li>
        <li class="mb-2">
          <strong>Управлявани от:</strong> Нас
        </li>
        <li class="mb-2">
          <strong>Цел:</strong> Тези бисквитки ни позволяват да запомним
          изборите, които правите, когато използвате Уебсайта, като запомняне на
          вашите данни за вход или езикови предпочитания. Целта на тези
          бисквитки е да ви предоставят по-лично изживяване и да избегнат
          необходимостта да въвеждате повторно предпочитанията си всеки път,
          когато използвате Уебсайта.
        </li>
      </ul>

      <h2 class="text-2xl font-bold mb-16 mt-24 text-center">
        Използване на вашите лични данни
      </h2>
      <p class="mb-4">
        Компанията може да използва Лични данни за следните цели:
      </p>
      <ul class="list-disc list-inside mb-4">
        <li class="mb-2">
          <strong>За предоставяне и поддържане на нашата Услуга</strong>,
          включително за наблюдение на използването на нашата Услуга.
        </li>
        <li class="mb-2">
          <strong>За управление на вашия Акаунт:</strong> за управление на
          вашата регистрация като потребител на Услугата. Личните данни, които
          предоставяте, могат да ви дадат достъп до различни функционалности на
          Услугата, които са достъпни за вас като регистриран потребител.
        </li>
        <li class="mb-2">
          <strong>За изпълнение на договор:</strong> разработване, спазване и
          предприемане на договор за покупка на продукти, артикули или услуги,
          които сте закупили, или на друг договор с нас чрез Услугата.
        </li>
        <li class="mb-2">
          <strong>За да се свържем с вас:</strong> за да се свържем с вас по
          имейл, телефонни обаждания, SMS или други еквивалентни форми на
          електронна комуникация, като например известия чрез мобилно приложение
          за актуализации или информативни съобщения, свързани с
          функционалности, продукти или договорени услуги, включително
          актуализации на сигурността, когато е необходимо или разумно за
          тяхното прилагане.
        </li>
        <li class="mb-2">
          <strong>
            За да ви предоставяме новини, специални оферти и обща информация за
            други стоки, услуги и събития, които предлагаме, които са подобни на
            тези, които вече сте закупили или за които сте се интересували,
            освен ако не сте избрали да не получавате такава информация.
          </strong>
        </li>
        <li class="mb-2">
          <strong>За управление на вашите заявки:</strong> За да присъединявате
          и управлявате вашите заявки към нас.
        </li>
      </ul>
    </div>
  );
};

export default CookiesPage;
